tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"
# Core application library for C
brew "glib"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# OpenType text shaping engine
brew "harfbuzz"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git", link: false
# Git extension for versioning large files
brew "git-lfs"
# Official GitLab CI runner
brew "gitlab-runner"
# LLVM's OpenMP runtime library
brew "libomp"
# Manage multiple Node.js versions
brew "nvm"
# High performance message passing library
brew "open-mpi"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community@4.4"
